app/controllers/containers_controller.rb

  def aproveRequest
    shipment = Shipment.find(params[:id])
    shipment.status = "Aprobado";
    shipment.save();
---
SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "shipments" SET "status" = $1, "updated_at" = $2 WHERE "shipments"."id" = $3  [["status", "Aprobado"], ["updated_at", "2016-07-26 00:45:57.332697"], ["id", 1]]

  def rejectRequest
    shipment = Shipment.find(params[:id])
    shipment.status = "Rechazado";
    shipment.save();
---
SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "shipments" SET "status" = $1, "updated_at" = $2 WHERE "shipments"."id" = $3  [["status", "Rechazado"], ["updated_at", "2016-07-26 00:46:42.014500"], ["id", 1]]

  def reserve
    @container = Container.find(params[:id])
---
SELECT  "containers".* FROM "containers" WHERE "containers"."id" = $1 LIMIT 1  [["id", 1]]

  def reservation
    container = Container.find params[:id]
    package= Package.find params[:package_id]
    shipment =Shipment.create()
    shipment.status ="Pendiente"
    shipment.package=package
    shipment.container =container
    shipment.save()
---
SELECT  "containers".* FROM "containers" WHERE "containers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "packages".* FROM "packages" WHERE "packages"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "shipments" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-07-23 18:21:02.392805"], ["updated_at", "2016-07-23 18:21:02.392805"]]
UPDATE "shipments" SET "status" = $1, "package_id" = $2, "container_id" = $3, "updated_at" = $4 WHERE "shipments"."id" = $5  [["status", "Pendiente"], ["package_id", 2], ["container_id", 1], ["updated_at", "2016-07-23 18:22:24.629877"], ["id", 2]]

  def index

    @containers = Container.where user_id: current_user.id
---
SELECT "containers".* FROM "containers" WHERE "containers"."user_id" = $1  [["user_id", 2]]

  def show
    @container = Container.find(params[:id])
    @shipments = Shipment.where container_id: @container.id
---
SELECT  "containers".* FROM "containers" WHERE "containers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "shipments".* FROM "shipments" WHERE "shipments"."container_id" = $1  [["container_id", 5]]

  def create
    @container = Container.new(container_params)
    current_user.containers<<@container
---
INSERT INTO "containers" ("title", "origin", "destiny", "shipping_day", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @container.destroy
---
DELETE FROM "containers" WHERE "containers"."id" = $1  [["id", 5]]

    def set_container
      @container = Container.find(params[:id])
---
SELECT  "containers".* FROM "containers" WHERE "containers"."id" = $1 LIMIT 1  [["id", 5]]