app/controllers/home_controller.rb

SELECT "containers".* FROM "containers"
---
	def index
		@containers =Container.all