app/controllers/packages_controller.rb

  def index
    @packages =Package.where user_id: current_user.id
---
SELECT "packages".* FROM "packages" WHERE "packages"."user_id" = $1  [["user_id", 6]]

  def show
     @package = Package.find(params[:id])
---
SELECT  "packages".* FROM "packages" WHERE "packages"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @package = Package.new(package_params)
    current_user.packages<<@package
---
INSERT INTO "packages" ("title", "dimension", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"